import moment from 'moment';
import React from 'react';
import BreadcrumbComponent from '../common/Breadcrumb';
import {API_URL} from '../../_main/routeConstant';
import { useParams } from 'react-router-dom';

const HistoryDetailsComponent = () => {
    const { id } = useParams(); // Get dynamic ID from URL
    const [historyData, setHistoryData] = React.useState(null); // State to store API response
    // const [loading, setLoading] = React.useState(true);
    // const [error, setError] = React.useState(null);
    // const apiUrl = `API_URL/history/history/script/${id}`;

    // React.useEffect(() => {
    //   const fetchData = async () => {
    //     try {
    //       const response = await fetch(apiUrl);
    //       if (!response.ok) throw new Error("Failed to fetch data");
    //       const data = await response.json();
    //       setHistoryData(data);
    //     } catch (err) {
    //       setError(err.message);
    //     } finally {
    //       setLoading(false);
    //     }
    //   };
    //   fetchData();
    // }, [id]);


    console.log("###", id);

    return (
      <div className="homebannerImages" style={{ marginTop: "30px" }} key={id}>
        <BreadcrumbComponent
          page="தல வரலாறு"
          sub="கல்வெட்டுகள்"
          child="விவரம்"
        />
        {/* IMAGE BANNER */}
        <div style={{ height: "400px" }}>
          <img
            src={historyData?.filepath || null}
            style={{ width: "100%", height: "100%" }}
          />
        </div>
        <div style={{ padding: "30px 0px" }}>
          {/* TITLE */}
          <div>
            {/* <h3>கல்வெட்டு தலைப்பு / குறிப்பு எண் - 16அ/ச2 பகுதி 14</h3> */}

          </div>
          {/* CONTENT */}
          <div style={{ marginTop: "30px", textAlign: "justify" }}>
            கி.பி.875 ம் ஆண்டு வரகுண பாண்டியன் திருச்செந்தூர் முருகன்
            வழிபாட்டிற்க்காக 1400 பொற்காசுகளை இவ்வூரை சுற்றிலுமுள்ள கிராம
            சபைகளுக்கு கொடுத்தார். அதற்க்கு ஈடாக ஒவ்வொரு ஊராரும் திருச்செந்தூர்
            கோவிலுக்கு அரிசி , நெய் , தயிர் , வாழைப்பழம், சக்கரை , மலர், தூபம் ,
            மிளகு,மஞ்சள், கீரகம், கடுகு, மல்லி வழங்க அறிவுறுத்தினார் .கல்வெட்டு
            எண்.16அ/ச2 பகுதி 14. மேலே உள்ள பொருள்களை திருக்கோயிலுக்கு திருவிழா
            காலங்களில் இரட்டிப்பாக கொடுப்பார்கள். கி.பி.875 ம் ஆண்டு வரகுண
            பாண்டியன் திருச்செந்தூர் முருகன் வழிபாட்டிற்க்காக 1400 பொற்காசுகளை
            இவ்வூரை சுற்றிலுமுள்ள கிராம சபைகளுக்கு கொடுத்தார். அதற்க்கு ஈடாக
            ஒவ்வொரு ஊராரும் திருச்செந்தூர் கோவிலுக்கு அரிசி , நெய் , தயிர் ,
            வாழைப்பழம், சக்கரை , மலர், தூபம் , மிளகு,மஞ்சள், கீரகம், கடுகு,
            மல்லி வழங்க அறிவுறுத்தினார் .கல்வெட்டு எண்.16அ/ச2 பகுதி 14. மேலே
            உள்ள பொருள்களை திருக்கோயிலுக்கு திருவிழா காலங்களில் இரட்டிப்பாக
            கொடுப்பார்கள். கி.பி.875 ம் ஆண்டு வரகுண பாண்டியன் திருச்செந்தூர்
            முருகன் வழிபாட்டிற்க்காக 1400 பொற்காசுகளை இவ்வூரை சுற்றிலுமுள்ள
            கிராம சபைகளுக்கு கொடுத்தார். அதற்க்கு ஈடாக ஒவ்வொரு ஊராரும்
            திருச்செந்தூர் கோவிலுக்கு அரிசி , நெய் , தயிர் , வாழைப்பழம், சக்கரை
            , மலர், தூபம் , மிளகு,மஞ்சள், கீரகம், கடுகு, மல்லி வழங்க
            அறிவுறுத்தினார் .கல்வெட்டு எண்.16அ/ச2 பகுதி 14. மேலே உள்ள பொருள்களை
            திருக்கோயிலுக்கு திருவிழா காலங்களில் இரட்டிப்பாக கொடுப்பார்கள்.
            கி.பி.875 ம் ஆண்டு வரகுண பாண்டியன் திருச்செந்தூர் முருகன்
            வழிபாட்டிற்க்காக 1400 பொற்காசுகளை இவ்வூரை சுற்றிலுமுள்ள கிராம
            சபைகளுக்கு கொடுத்தார். அதற்க்கு ஈடாக ஒவ்வொரு ஊராரும் திருச்செந்தூர்
            கோவிலுக்கு அரிசி , நெய் , தயிர் , வாழைப்பழம், சக்கரை , மலர், தூபம் ,
            மிளகு,மஞ்சள், கீரகம், கடுகு, மல்லி வழங்க அறிவுறுத்தினார் .கல்வெட்டு
            எண்.16அ/ச2 பகுதி 14. மேலே உள்ள பொருள்களை திருக்கோயிலுக்கு திருவிழா
            காலங்களில் இரட்டிப்பாக கொடுப்பார்கள். கி.பி.875 ம் ஆண்டு வரகுண
            பாண்டியன் திருச்செந்தூர் முருகன் வழிபாட்டிற்க்காக 1400 பொற்காசுகளை
            இவ்வூரை சுற்றிலுமுள்ள கிராம சபைகளுக்கு கொடுத்தார். அதற்க்கு ஈடாக
            ஒவ்வொரு ஊராரும் திருச்செந்தூர் கோவிலுக்கு அரிசி , நெய் , தயிர் ,
            வாழைப்பழம், சக்கரை , மலர், தூபம் , மிளகு,மஞ்சள், கீரகம், கடுகு,
            மல்லி வழங்க அறிவுறுத்தினார் .கல்வெட்டு எண்.16அ/ச2 பகுதி 14. மேலே
            உள்ள பொருள்களை திருக்கோயிலுக்கு திருவிழா காலங்களில் இரட்டிப்பாக
            கொடுப்பார்கள்
          </div>
          <div style={{ marginTop: "30px", textAlign: "right" }}>
            <span style={{ fontWeight: 600 }}>Posted On : </span>
            {moment("2025-01-30T14:17:28.878851").format("DD/MM/YYYY hh:mm a")}
          </div>
        </div>
      </div>
    );
}

export default HistoryDetailsComponent;